#include"voice.h"
void Voice_Init()/*语音识别初始化*/
{
	Uart_SendYuYin(0xa0,0xa0,0xa0);//语音识别模块初始化
	delay50ms();
	Uart_SendYuYin(0xa1,0x10,0x05);//配置麦克风灵敏度
	delay50ms();
	Uart_SendYuYin(0xa2,0x22,0x24);//配置噪声门限
	delay50ms();
}
/*****************************************************************************************************
 - 功能描述： 串口1发送一帧数据(语音识别模块)
 - 隶属模块： 内部 
 - 参数说明： 
 - 返回说明： 
 - 注：无     
*****************************************************************************************************/
void SendYY(uchar len)
{
    uchar i = 0 ;
    for(i=0; i<len; i++)/*数据*/
    {
		UART_1SendOneByte(Send_buf[i]) ;
    }
}
/**************************************************************************************
 - 功能描述： 串口1向外发送命令(语音)
 - 隶属模块： 外部
 - 参数说明： YS表示首位标识  YL表示低八位  YH 表示高八位
 - 返回说明：
 - 注：
**************************************************************************************/
void Uart_SendYuYin(uchar YS,uchar YL,uchar YH)
{
	Send_buf[0] = YS;
	Send_buf[1] = YL;
	Send_buf[2] = YH;
	SendYY(3);
}
